results/factorial-final/security-overhead-final-mtls-broker5/security-overhead-final-factorial-mtls-b5-rf5-isr4-msg10240-tps10000-batch131072-acksall-prod12-compnone-trial2/producer-perf-8.log
producer_index=8
producer_count=12
producer_records=8333
producer_throughput=833
1 records sent, 0.1 records/sec (0.00 MB/sec), 19602.0 ms avg latency, 19602.0 ms max latency.
276 records sent, 51.4 records/sec (0.50 MB/sec), 8357.9 ms avg latency, 10733.0 ms max latency.
1008 records sent, 190.5 records/sec (1.86 MB/sec), 9494.8 ms avg latency, 11872.0 ms max latency.
1572 records sent, 303.5 records/sec (2.96 MB/sec), 12063.7 ms avg latency, 13591.0 ms max latency.
1872 records sent, 370.5 records/sec (3.62 MB/sec), 10765.1 ms avg latency, 15297.0 ms max latency.
1992 records sent, 389.8 records/sec (3.81 MB/sec), 8270.0 ms avg latency, 9747.0 ms max latency.
8333 records sent, 171.803806 records/sec (1.68 MB/sec), 9513.63 ms avg latency, 19602.00 ms max latency, 8815 ms 50th, 13001 ms 95th, 14619 ms 99th, 15297 ms 99.9th.